---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilledRegionType
source: html/cc0e8b16-ffe7-d6e7-66ce-f64b25c0e0eb.htm
---
# FilledRegionType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.